notes/selenium-learning.org
#+TITLE:       Selenium 笔记
#+AUTHOR:      Dylan Yang
#+EMAIL:       banshiliuli1990@sina.com
#+DATE:        2016-01-06 三
#+URI:         /notes/%y/%m/%d/selenium-learning
#+KEYWORDS:    Selenium API, XPath
#+TAGS:        Selenium, XPath
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: Selenium 进行自动化的入门

* xpath 语法
XPath 是 XML 的查询语言，和 SQL 的角色很类似。以下面 XML 为例，介绍 XPath 的语法
#+BEGIN_SRC html
<?xml version="1.0" encoding="ISO-8859-1"?>
<catalog>

   <cd country="USA">
      <title>Empire Burlesque</title>
      <artist>Bob Dylan</artist>
      <price>10.90</price>
   </cd>

   <cd country="UK">
     <title>Hide your heart</title>
     <artist>Bonnie Tyler</artist>
     <price>9.90</price>
   </cd>

   <cd country="USA">
     <title>Greatest Hits</title>
     <artist>Dolly Parton</artist>
     <price>9.90</price>
   </cd></catalog>

</catalog>
#+END_SRC
** 定位节点
XML 是树状结构，类似档案系统内数据夹的结构，XPath 也类似档案系统的路径命名方式。不过 XPath 是一种模式(Pattern)，可以选出 XML 档案中，路径符合某个模式的所有节点出来。例如要选 catalog 底下的 cd 中所有 price 元素可以用:
#+BEGIN_EXAMPLE
/catalog/cd/price
#+END_EXAMPLE
如果 XPath 的开头是一个斜线（/）代表这是绝对路径。如果开头是两个斜线（//）表示文件中所有符合模式的元素都会被选出来，即使是处于树中不同的层级也会被选出来。以下的语法会选出文件中所有叫做 cd 的元素（在树中的任何层级都会被选出来）：
#+BEGIN_EXAMPLE
//cd
#+END_EXAMPLE
** 选择未知的元素
使用星号（Wildcards,＊）可以选择未知的元素。下面这个语法会选出/catalog/cd 的所有子元素：
#+BEGIN_EXAMPLE
/catalog/cd/*
#+END_EXAMPLE
以下的语法会选出所有 catalog 的子元素中，包含有 price 作为子元素的元素。
#+BEGIN_EXAMPLE
/catalog/*/price
#+END_EXAMPLE
以下的语法会选出有两层父节点，叫做 price 的所有元素。
#+BEGIN_EXAMPLE
/*/*/price
#+END_EXAMPLE
以下的语法会选择出文件中的所有元素。
#+BEGIN_EXAMPLE
//*
#+END_EXAMPLE
要注意的是，想要存取不分层级的元素，XPath 语法必须以两个斜线开头(//)，想要存取未知元素才用星号(*)，星号只能代表未知名称的元素，不能代表未知层级的元素。
** 选择分支
使用中括号可以选择分支。以下的语法从 catalog 的子元素中取出第一个叫做 cd 的元素。XPath 的定义中没有第 0 元素这种东西。
#+BEGIN_EXAMPLE
/catalog/cd[1]
#+END_EXAMPLE
以下语法选择 catalog 中的最后一个 cd 元素：（XPathj 并没有定义 first() 这种函式喔，用上例的 [ 1 ] 就可以取出第一个元素。
#+BEGIN_EXAMPLE
/catalog/cd[last()]
#+END_EXAMPLE
以下语法选出含有 price 子元素的所有/catalog/cd 元素。
#+BEGIN_EXAMPLE
/catalog/cd[price]
#+END_EXAMPLE
以下语法选出 price 元素的值等于 10.90 的所有/catalog/cd 元素
#+BEGIN_EXAMPLE
/catalog/cd[price=10.90]
#+END_EXAMPLE
以下语法选出 price 元素的值等于 10.90 的所有/catalog/cd 元素 的 price 元素
#+BEGIN_EXAMPLE
/catalog/cd[price=10.90]/price
#+END_EXAMPLE
** 选择一个以上的路径
使用 Or 操作数(|)就可以选择一个以上的路径。例如：
#+BEGIN_EXAMPLE
/catalog/cd/title | catalog/cd/artist
#+END_EXAMPLE
选择所有 title 以及 artist 元素
#+BEGIN_EXAMPLE
//title | //artist
#+END_EXAMPLE
选择所有 title 以及 artist 以及 price 元素
#+BEGIN_EXAMPLE
//title | //artist | //price
#+END_EXAMPLE
** 选择属性
在 XPath 中，除了选择元素以外，也可以选择属性。属性都是以@开头。例如选择文件中所有叫做 country 的属性。
#+BEGIN_EXAMPLE
//@country
#+END_EXAMPLE
选择所有含有 country 这个属性的 cd 元素：
#+BEGIN_EXAMPLE
//cd[@country]
#+END_EXAMPLE
以下语法选择出含有属性的所有 cd 元素
#+BEGIN_EXAMPLE
//cd[@*]
#+END_EXAMPLE
以下语法选择出 country 属性值为 UK 的 cd 元
#+BEGIN_EXAMPLE
//cd[@country='UK']
#+END_EXAMPLE
选择多个属性
#+BEGIN_EXAMPLE
//cd[@country='UK'][@name='hyddd']
#+END_EXAMPLE
* selenium 常见 API
** Commands
 Action：对学前状态进行操作，失败时，停止测试。
 Assertion：校验是否有产生正确的值。
 Element Locators：指定 HTML 中的元素。
 Patterns：用于模式匹配。
*** Element Locators(元素定位）
如果没有 locator 前序的情况下，如果以 "document" 开头，就默认使用 dom locator,如果是以 "//" 开头，就默认使用 xpath locator, 其余情况均认作 identifier locator。
***** id = id
id locator 指定 HTML 中的唯一 id 元素
***** name = name
name locator 指定 HTML 中相同 name 的元素中的第一个元素
***** identifier = id
identifier locator 首先查找 HTML 是否存在该 id 的元素，若不存在，查找第一个该 name 的元素
***** dom = javascriptExpression
dom locator 用 JavaScript 表达式来定位 HTML 中的元素，注意必须要以 "document" 开头
例如：
#+BEGIN_SRC java
dom = document.forms['myForm'].myDropdown
dom = document.images[56]
#+END_SRC
***** xpath = xpathExpression
xpath locator 用 Xpath 表达式来定位 HTML 中的元素，必须注意要以 ="//"= 开头
例如：
#+BEGIN_SRC java
xpath = //[@alt='The image alt text']
xpath = //table[@id='table1']//tr[4]/td[2]
#+END_SRC
***** link = textPattern
link locator 用 link 来选择 HTML 中的连接或锚元素
例如：
#+BEGIN_SRC java
link = The link text
#+END_SRC
*** String Matching Patterns(字符串匹配）
在没有指定字符串匹配前序的时候，selenium 默认使用 golb 匹配模式
***** glob : patthern
glob 模式，用通用匹配符 "*" 代表任意长度字符， "?" 代表一个字符
***** regexp : regexp
正则表达式模式，用 JavaScript 正则表达式的形式匹配字符串
***** exact : string
精确匹配模式，精确匹配整个字符串，不能用通配符
*** Select Option Specifiers(select 选项指定器)
在没有选择前序的情况下，默认是匹配选项的文本
***** label = labelPattern
通过匹配选项中的文本指定选项
例如：
#+BEGIN_SRC java
label = regexp:^[Oo]ther
#+END_SRC
***** value = valuePattern
通过匹配选项中的指定选项
例如：
#+BEGIN_SRC java
value = other
#+END_SRC
***** id = id
通过匹配选项的 id 指定选项
例如：
#+BEGIN_SRC java
id = option1
#+END_SRC
***** index = index
通过匹配选项的序号指定选项，序号从 0 开始
例如：
#+BEGIN_SRC java
inde = 2
#+END_SRC
** Action
描述了用户所会作出的操作
Action 有两种形式：action 和 actionAndWait，action 会立即执行，面 actionAndWait 会假设需要较长时间才能得到该 action 的响应，而作出等待，open 则是会处运算理等待时间。
*** click
 click(elementLocator)
- 点击连接按钮，筛选和单选框
- 如果点击后需要待响应，则用 =clickAndWait=
- 如果需要经过 JavaScript 的 alert 或 confirm 对话框后才能继续操作，则需要调用 verify 或 assert 来告诉 Selenium 你期望对对话框进行什么操作
| clickAndWait | aCheckbox    |
| clickAndWait | submitButton |
| clickAndWait | anyLink      |
