notes/2016/01/06/selenium-learning/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Selenium 笔记 - 行走的西葫芦</title>
    <meta charset="utf-8" />
    <meta name="author" content="Dylan Yang" />
    <meta name="description" content="Selenium 进行自动化的入门" />
    <meta name="keywords" content="Selenium API, XPath" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify-solarized-light.css" type="text/css">
    <link href="https://cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet">
  </head>

  <body class="container">
    <div>
      <header class="masthead">
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="zucchiniY.github.io">
        </form>
        <h1 class="masthead-title"><a href="/">行走的西葫芦</a></h1>
        <p>世事洞明皆学问，人情练达即文章。</p>
        <ul>
          <li><a href="/blog/"><i class="fa fa-archive"></i>Blog</a></li>
          <li><a href="/notes/"><i class="fa fa-archive"></i>Notes</a></li>
          <li><a href="/tags/"><i class="fa fa-tag"></i>Tags</a></li>
          <li><a href="/about/"><i class="fa fa-user"></i>About</a></li>
          <li><a href="https://github.com/ZucchiniY"><i class="fa fa-github"></i>GitHub</a></li>
          <li><a href="/rss.xml"><i class="fa fa-rss-square"></i>RSS</a></li>
        </ul>
      </header>
    </div>

<div>
<div class="post">
<h1>Selenium 笔记</h1>

<div id="outline-container-org31aadea" class="outline-2">
<h2 id="org31aadea">xpath 语法</h2>
<div class="outline-text-2" id="text-org31aadea">
<p>
XPath 是 XML 的查询语言，和 SQL 的角色很类似。以下面 XML 为例，介绍 XPath 的语法
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;catalog&gt;

   &lt;cd country="USA"&gt;
      &lt;title&gt;Empire Burlesque&lt;/title&gt;
      &lt;artist&gt;Bob Dylan&lt;/artist&gt;
      &lt;price&gt;10.90&lt;/price&gt;
   &lt;/cd&gt;

   &lt;cd country="UK"&gt;
     &lt;title&gt;Hide your heart&lt;/title&gt;
     &lt;artist&gt;Bonnie Tyler&lt;/artist&gt;
     &lt;price&gt;9.90&lt;/price&gt;
   &lt;/cd&gt;

   &lt;cd country="USA"&gt;
     &lt;title&gt;Greatest Hits&lt;/title&gt;
     &lt;artist&gt;Dolly Parton&lt;/artist&gt;
     &lt;price&gt;9.90&lt;/price&gt;
   &lt;/cd&gt;&lt;/catalog&gt;

&lt;/catalog&gt;
</pre>
</div>
</div>
<div id="outline-container-orgde6684b" class="outline-3">
<h3 id="orgde6684b">定位节点</h3>
<div class="outline-text-3" id="text-orgde6684b">
<p>
XML 是树状结构，类似档案系统内数据夹的结构，XPath 也类似档案系统的路径命名方式。不过 XPath 是一种模式(Pattern)，可以选出 XML 档案中，路径符合某个模式的所有节点出来。例如要选 catalog 底下的 cd 中所有 price 元素可以用:
</p>
<pre class="example">
/catalog/cd/price
</pre>
<p>
如果 XPath 的开头是一个斜线（/）代表这是绝对路径。如果开头是两个斜线（//）表示文件中所有符合模式的元素都会被选出来，即使是处于树中不同的层级也会被选出来。以下的语法会选出文件中所有叫做 cd 的元素（在树中的任何层级都会被选出来）：
</p>
<pre class="example">
//cd
</pre>
</div>
</div>
<div id="outline-container-org51d3fd2" class="outline-3">
<h3 id="org51d3fd2">选择未知的元素</h3>
<div class="outline-text-3" id="text-org51d3fd2">
<p>
使用星号（Wildcards,＊）可以选择未知的元素。下面这个语法会选出/catalog/cd 的所有子元素：
</p>
<pre class="example">
/catalog/cd/*
</pre>
<p>
以下的语法会选出所有 catalog 的子元素中，包含有 price 作为子元素的元素。
</p>
<pre class="example">
/catalog/*/price
</pre>
<p>
以下的语法会选出有两层父节点，叫做 price 的所有元素。
</p>
<pre class="example">
/*/*/price
</pre>
<p>
以下的语法会选择出文件中的所有元素。
</p>
<pre class="example">
//*
</pre>
<p>
要注意的是，想要存取不分层级的元素，XPath 语法必须以两个斜线开头(//)，想要存取未知元素才用星号(*)，星号只能代表未知名称的元素，不能代表未知层级的元素。
</p>
</div>
</div>
<div id="outline-container-org6e74f02" class="outline-3">
<h3 id="org6e74f02">选择分支</h3>
<div class="outline-text-3" id="text-org6e74f02">
<p>
使用中括号可以选择分支。以下的语法从 catalog 的子元素中取出第一个叫做 cd 的元素。XPath 的定义中没有第 0 元素这种东西。
</p>
<pre class="example">
/catalog/cd[1]
</pre>
<p>
以下语法选择 catalog 中的最后一个 cd 元素：（XPathj 并没有定义 first() 这种函式喔，用上例的 [ 1 ] 就可以取出第一个元素。
</p>
<pre class="example">
/catalog/cd[last()]
</pre>
<p>
以下语法选出含有 price 子元素的所有/catalog/cd 元素。
</p>
<pre class="example">
/catalog/cd[price]
</pre>
<p>
以下语法选出 price 元素的值等于 10.90 的所有/catalog/cd 元素
</p>
<pre class="example">
/catalog/cd[price=10.90]
</pre>
<p>
以下语法选出 price 元素的值等于 10.90 的所有/catalog/cd 元素 的 price 元素
</p>
<pre class="example">
/catalog/cd[price=10.90]/price
</pre>
</div>
</div>
<div id="outline-container-org46aa0b2" class="outline-3">
<h3 id="org46aa0b2">选择一个以上的路径</h3>
<div class="outline-text-3" id="text-org46aa0b2">
<p>
使用 Or 操作数(|)就可以选择一个以上的路径。例如：
</p>
<pre class="example">
/catalog/cd/title | catalog/cd/artist
</pre>
<p>
选择所有 title 以及 artist 元素
</p>
<pre class="example">
//title | //artist
</pre>
<p>
选择所有 title 以及 artist 以及 price 元素
</p>
<pre class="example">
//title | //artist | //price
</pre>
</div>
</div>
<div id="outline-container-orge9d8ea6" class="outline-3">
<h3 id="orge9d8ea6">选择属性</h3>
<div class="outline-text-3" id="text-orge9d8ea6">
<p>
在 XPath 中，除了选择元素以外，也可以选择属性。属性都是以@开头。例如选择文件中所有叫做 country 的属性。
</p>
<pre class="example">
//@country
</pre>
<p>
选择所有含有 country 这个属性的 cd 元素：
</p>
<pre class="example">
//cd[@country]
</pre>
<p>
以下语法选择出含有属性的所有 cd 元素
</p>
<pre class="example">
//cd[@*]
</pre>
<p>
以下语法选择出 country 属性值为 UK 的 cd 元
</p>
<pre class="example">
//cd[@country='UK']
</pre>
<p>
选择多个属性
</p>
<pre class="example">
//cd[@country='UK'][@name='hyddd']
</pre>
</div>
</div>
</div>
<div id="outline-container-org19b3c98" class="outline-2">
<h2 id="org19b3c98">selenium 常见 API</h2>
<div class="outline-text-2" id="text-org19b3c98">
</div>
<div id="outline-container-org3a4db76" class="outline-3">
<h3 id="org3a4db76">Commands</h3>
<div class="outline-text-3" id="text-org3a4db76">
<p>
Action：对学前状态进行操作，失败时，停止测试。
Assertion：校验是否有产生正确的值。
Element Locators：指定 HTML 中的元素。
Patterns：用于模式匹配。
</p>
</div>
<div id="outline-container-orgd745277" class="outline-4">
<h4 id="orgd745277">Element Locators(元素定位）</h4>
<div class="outline-text-4" id="text-orgd745277">
<p>
如果没有 locator 前序的情况下，如果以 "document" 开头，就默认使用 dom locator,如果是以 "//" 开头，就默认使用 xpath locator, 其余情况均认作 identifier locator。
</p>
</div>
<ul class="org-ul">
<li><a id="org39d9cfd"></a>id = id<br />
<div class="outline-text-6" id="text-org39d9cfd">
<p>
id locator 指定 HTML 中的唯一 id 元素
</p>
</div>
</li>
<li><a id="org58b958e"></a>name = name<br />
<div class="outline-text-6" id="text-org58b958e">
<p>
name locator 指定 HTML 中相同 name 的元素中的第一个元素
</p>
</div>
</li>
<li><a id="org9025fc4"></a>identifier = id<br />
<div class="outline-text-6" id="text-org9025fc4">
<p>
identifier locator 首先查找 HTML 是否存在该 id 的元素，若不存在，查找第一个该 name 的元素
</p>
</div>
</li>
<li><a id="org96414e2"></a>dom = javascriptExpression<br />
<div class="outline-text-6" id="text-org96414e2">
<p>
dom locator 用 JavaScript 表达式来定位 HTML 中的元素，注意必须要以 "document" 开头
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">dom = document.forms['myForm'].myDropdown
dom = document.images[56]
</pre>
</div>
</div>
</li>
<li><a id="org97747ec"></a>xpath = xpathExpression<br />
<div class="outline-text-6" id="text-org97747ec">
<p>
xpath locator 用 Xpath 表达式来定位 HTML 中的元素，必须注意要以 <code>"//"</code> 开头
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">xpath = //[@alt='The image alt text']
xpath = //table[@id='table1']//tr[4]/td[2]
</pre>
</div>
</div>
</li>
<li><a id="org133e86b"></a>link = textPattern<br />
<div class="outline-text-6" id="text-org133e86b">
<p>
link locator 用 link 来选择 HTML 中的连接或锚元素
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">link = The link text
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgf9b09df" class="outline-4">
<h4 id="orgf9b09df">String Matching Patterns(字符串匹配）</h4>
<div class="outline-text-4" id="text-orgf9b09df">
<p>
在没有指定字符串匹配前序的时候，selenium 默认使用 golb 匹配模式
</p>
</div>
<ul class="org-ul">
<li><a id="org505baf5"></a>glob : patthern<br />
<div class="outline-text-6" id="text-org505baf5">
<p>
glob 模式，用通用匹配符 "*" 代表任意长度字符， "?" 代表一个字符
</p>
</div>
</li>
<li><a id="org397b62a"></a>regexp : regexp<br />
<div class="outline-text-6" id="text-org397b62a">
<p>
正则表达式模式，用 JavaScript 正则表达式的形式匹配字符串
</p>
</div>
</li>
<li><a id="org391063d"></a>exact : string<br />
<div class="outline-text-6" id="text-org391063d">
<p>
精确匹配模式，精确匹配整个字符串，不能用通配符
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7dc96fa" class="outline-4">
<h4 id="org7dc96fa">Select Option Specifiers(select 选项指定器)</h4>
<div class="outline-text-4" id="text-org7dc96fa">
<p>
在没有选择前序的情况下，默认是匹配选项的文本
</p>
</div>
<ul class="org-ul">
<li><a id="orgfed9224"></a>label = labelPattern<br />
<div class="outline-text-6" id="text-orgfed9224">
<p>
通过匹配选项中的文本指定选项
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">label = regexp:^[Oo]ther
</pre>
</div>
</div>
</li>
<li><a id="org6f36244"></a>value = valuePattern<br />
<div class="outline-text-6" id="text-org6f36244">
<p>
通过匹配选项中的指定选项
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">value = other
</pre>
</div>
</div>
</li>
<li><a id="orgf2c0dd5"></a>id = id<br />
<div class="outline-text-6" id="text-orgf2c0dd5">
<p>
通过匹配选项的 id 指定选项
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">id = option1
</pre>
</div>
</div>
</li>
<li><a id="org8aa500d"></a>index = index<br />
<div class="outline-text-6" id="text-org8aa500d">
<p>
通过匹配选项的序号指定选项，序号从 0 开始
例如：
</p>
<div class="org-src-container">
<pre class="src src-java">inde = 2
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org318aedd" class="outline-3">
<h3 id="org318aedd">Action</h3>
<div class="outline-text-3" id="text-org318aedd">
<p>
描述了用户所会作出的操作
Action 有两种形式：action 和 actionAndWait，action 会立即执行，面 actionAndWait 会假设需要较长时间才能得到该 action 的响应，而作出等待，open 则是会处运算理等待时间。
</p>
</div>
<div id="outline-container-org5b2d002" class="outline-4">
<h4 id="org5b2d002">click</h4>
<div class="outline-text-4" id="text-org5b2d002">
<p>
click(elementLocator)
</p>
<ul class="org-ul">
<li>点击连接按钮，筛选和单选框</li>
<li>如果点击后需要待响应，则用 <code>clickAndWait</code></li>
<li>如果需要经过 JavaScript 的 alert 或 confirm 对话框后才能继续操作，则需要调用 verify 或 assert 来告诉 Selenium 你期望对对话框进行什么操作</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">clickAndWait</td>
<td class="org-left">aCheckbox</td>
</tr>

<tr>
<td class="org-left">clickAndWait</td>
<td class="org-left">submitButton</td>
</tr>

<tr>
<td class="org-left">clickAndWait</td>
<td class="org-left">anyLink</td>
</tr>
</tbody>
</table>
</div>
</div>
