notes/2016/01/06/selenium-learning/index.html
<div id="outline-container-org3f3f90f" class="outline-4">
<h4 id="org3f3f90f">open</h4>
<div class="outline-text-4" id="text-org3f3f90f">
<p>
open(url)
</p>
<ul class="org-ul">
<li>在浏览器中打开 URL，可以授受相对和绝对路径两种形式</li>
<li>注意：该 URL 必须在与浏览器相同的安全限定范围之内</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">open</td>
<td class="org-left">/mypage</td>
</tr>

<tr>
<td class="org-left">open</td>
<td class="org-left"><a href="http://localhost/">http://localhost/</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd3a3c14" class="outline-4">
<h4 id="orgd3a3c14">type</h4>
<div class="outline-text-4" id="text-orgd3a3c14">
<p>
type(inputLocator, value)
</p>
<ul class="org-ul">
<li>模拟人手的输入过程，往指定的 input 中输入值</li>
<li>也适合给复选和单选框赋值</li>
<li>在这个例子中，则只是给钩选了的复选框赋值，注意：而不是改写其文本</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">type</td>
<td class="org-left">nameField</td>
<td class="org-left">John Smith</td>
</tr>

<tr>
<td class="org-left">typeAndWait</td>
<td class="org-left">textBoxThatSubmitsOnChange</td>
<td class="org-left">newValue</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc2cc4ed" class="outline-4">
<h4 id="orgc2cc4ed">select</h4>
<div class="outline-text-4" id="text-orgc2cc4ed">
<p>
select(dropDownLocator, optionSpecifier)
</p>
<ul class="org-ul">
<li>根据 optionSpecifier 选项选择器来选择一个下拉菜单选项</li>
<li>如果有多于一个选择器的时候，如在用通配符模式，如 <code>f*b*</code> ，或者超过一个选项有相同的文本或值，则会选择第一个匹配到的值</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">select</td>
<td class="org-left">dropDown</td>
<td class="org-left">Australian Dollars</td>
</tr>

<tr>
<td class="org-left">select</td>
<td class="org-left">dropDown</td>
<td class="org-left">index = 0</td>
</tr>

<tr>
<td class="org-left">selectAndWait</td>
<td class="org-left">currencySelector</td>
<td class="org-left">value = AUD</td>
</tr>

<tr>
<td class="org-left">selectAndWait</td>
<td class="org-left">currencySelector</td>
<td class="org-left">label = Australian D*rs</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2954016" class="outline-4">
<h4 id="org2954016">goBack, close</h4>
<div class="outline-text-4" id="text-org2954016">
<p>
goBack()
</p>
<ul class="org-ul">
<li>模拟点击浏览器后退按钮</li>
</ul>
<p>
close()
</p>
<ul class="org-ul">
<li>模拟点击浏览器关闭按钮</li>
</ul>
</div>
</div>
<div id="outline-container-orgde73916" class="outline-4">
<h4 id="orgde73916">selectWindow</h4>
<div class="outline-text-4" id="text-orgde73916">
<p>
select(windowId)
</p>
<ul class="org-ul">
<li>选择一个弹出窗口</li>
<li>当选中那个窗口的时候，所有的命令将会转移到那个窗口中执行</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">selectWindow</td>
<td class="org-left">myPopupWindow</td>
</tr>

<tr>
<td class="org-left">selectWindow</td>
<td class="org-left">null</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org732de28" class="outline-4">
<h4 id="org732de28">pause</h4>
<div class="outline-text-4" id="text-org732de28">
<p>
pause(millisenconds)
</p>
<ul class="org-ul">
<li>根据指定时间暂停 Selenium 脚本执行</li>
<li>常用在调试脚本或等待服务器段响应时</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">pause</td>
<td class="org-right">5000</td>
</tr>

<tr>
<td class="org-left">pause</td>
<td class="org-right">2000</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd7e178f" class="outline-4">
<h4 id="orgd7e178f">fireEvent</h4>
<div class="outline-text-4" id="text-orgd7e178f">
<p>
fireEvent(elementLocator,evenName)
</p>
<ul class="org-ul">
<li>模拟页面元素事件被激活的处理动作</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">fireEvent</td>
<td class="org-left">textField</td>
<td class="org-left">focus</td>
</tr>

<tr>
<td class="org-left">fireEvent</td>
<td class="org-left">dropDown</td>
<td class="org-left">blur</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1423869" class="outline-4">
<h4 id="org1423869">waitForCondition</h4>
<div class="outline-text-4" id="text-org1423869">
<p>
waitForCondition(JavaSvriptSnippet,time)
</p>
<ul class="org-ul">
<li>在限定时间内，等待一段 JavaScript 代码返回 true 值，超时则停止等待</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">waitForCondition</td>
<td class="org-left">var value = selenium.getText("foo");</td>
<td class="org-right">3000</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">value.match(<i>bar</i>);</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8cfd574" class="outline-4">
<h4 id="org8cfd574">waitForValue</h4>
<div class="outline-text-4" id="text-org8cfd574">
<p>
waitForValue(inputLocator,value)
</p>
<ul class="org-ul">
<li>等待 input，如：hidden input 待被赋予某值</li>
<li>会轮流检测该值，所以要注意如果该值长时间一直未赋予该 input 值的话，可能会导致阻塞</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">waitForValue</td>
<td class="org-left">finishIndication</td>
<td class="org-left">isfinished</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org12d2464" class="outline-4">
<h4 id="org12d2464">store, storeValue</h4>
<div class="outline-text-4" id="text-org12d2464">
<p>
store(valueToStore, variablename)
</p>
<ul class="org-ul">
<li>保存一个值到变量里</li>
<li>该值可以由自其它变量组合而成或者通过 JavaScript 表达式赋值给变量</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">store</td>
<td class="org-left">Mr John Smith</td>
<td class="org-left">fullname</td>
</tr>

<tr>
<td class="org-left">store</td>
<td class="org-left">$. {firstname} $. {suname}</td>
<td class="org-left">fullname</td>
</tr>

<tr>
<td class="org-left">store</td>
<td class="org-left">javascript. {Math.round(Math.PI*100)/100}</td>
<td class="org-left">PI</td>
</tr>

<tr>
<td class="org-left">storeValue</td>
<td class="org-left">inputLocator</td>
<td class="org-left">variableName</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>把指定的 input 中的值保存到变量中</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">storeValue</td>
<td class="org-left">userName</td>
<td class="org-left">userID</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-left">userName</td>
<td class="org-left">$. {userID}</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0e6039b" class="outline-4">
<h4 id="org0e6039b">storeText, storeAttribute</h4>
<div class="outline-text-4" id="text-org0e6039b">
<p>
storeText(elementLocator,variablename)
</p>
<ul class="org-ul">
<li>把指定元素的文本值赋予给变量</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">storeText</td>
<td class="org-left">currentDate</td>
<td class="org-left">expectedStartDate</td>
</tr>

<tr>
<td class="org-left">verifyValue</td>
<td class="org-left">startDate</td>
<td class="org-left">$. {expectedStartDate}</td>
</tr>
</tbody>
</table>
<p>
storeAttribute(.{} elementLocator@attributeName, variableName.{})
</p>
<ul class="org-ul">
<li>把指定元素的属性的值赋予变量</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">storeAttribute</td>
<td class="org-left">input1@class</td>
<td class="org-left">classOfInput1</td>
</tr>

<tr>
<td class="org-left">verifyAttribute</td>
<td class="org-left">input2@class</td>
<td class="org-left">$.{classOfInput1}</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6d6e68b" class="outline-4">
<h4 id="org6d6e68b">chooseCancel.., answer..</h4>
<div class="outline-text-4" id="text-org6d6e68b">
<p>
chooseCancelOnNextConfirmation()
</p>
<ul class="org-ul">
<li>当下次 JavaScript 弹出 confirm 对话框的时候，让 selenium 选择 Cancel</li>
<li>如果没有该命令时，遇到 confirm 对话框的，selenium 默认返回 true，和手动选择 OK 按钮一样</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">chooseCancelOnNextConfirmation</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>如果已经运行过该命令，当下一次又有 confirm 对话框出现时，也会同样地再次选择 Cancel</li>
</ul>
<p>
answerOnNextPrompt(answerString)
</p>
<ul class="org-ul">
<li>在下次 JavaScript 弹出 prompt 提示框时，赋予其 answerString 的值，并选择确定</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">answerOnNextPrompt</td>
<td class="org-left">Kangaroo</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orga1d60b4" class="outline-3">
<h3 id="orga1d60b4">Assertions</h3>
<div class="outline-text-3" id="text-orga1d60b4">
<p>
允许用户去检查当前状态，两种模式：Assert 和 Verify，当 Assert 失败，则退出测试；当 Verify 失败，测试会继续运行
</p>
</div>
<div id="outline-container-org8ac7ce3" class="outline-4">
<h4 id="org8ac7ce3">assertLocation, assertTitle</h4>
<div class="outline-text-4" id="text-org8ac7ce3">
<p>
assertLocation(relativelLocation)
</p>
<ul class="org-ul">
<li>判断当前是在正确页面</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyLocation</td>
<td class="org-left">/mypage</td>
</tr>

<tr>
<td class="org-left">assertLocation</td>
<td class="org-left">/mypage</td>
</tr>
</tbody>
</table>
<p>
assertTitle(titlePattern)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyTitle</td>
<td class="org-left">My Page</td>
</tr>

<tr>
<td class="org-left">assertTitle</td>
<td class="org-left">My Page</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org512f136" class="outline-4">
<h4 id="org512f136">assertValue</h4>
<div class="outline-text-4" id="text-org512f136">
<p>
asserValue(inputLocator, valuePattern)
</p>
<ul class="org-ul">
<li>检查 input 的值</li>
<li>对于 checkbox 或 radio，如果已选择，则值为 <code>on</code> ，反之为 <code>off</code></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyValue</td>
<td class="org-left">nameField</td>
<td class="org-left">John Smith</td>
</tr>

<tr>
<td class="org-left">assertValue</td>
<td class="org-left">document.forms[a].nameField</td>
<td class="org-left">John Smith</td>
</tr>
</tbody>
</table>
</div>
</div>
