notes/2016/01/06/selenium-learning/index.html
<div id="outline-container-org90d41b6" class="outline-4">
<h4 id="org90d41b6">assertSelected, assertSelectedOptions</h4>
<div class="outline-text-4" id="text-org90d41b6">
<p>
assertSelected(selectLocator, optionSpecifier)
</p>
<ul class="org-ul">
<li>检查 select 的下拉菜单中选中的选型是否和 optionSpecifer(select 选择选项器)的选项相同</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifySelected</td>
<td class="org-left">dropdown2</td>
<td class="org-left">John Smith</td>
</tr>

<tr>
<td class="org-left">verifySelected</td>
<td class="org-left">dropdown2</td>
<td class="org-left">value = js * 123</td>
</tr>

<tr>
<td class="org-left">assertSelected</td>
<td class="org-left">document.forms[a].dropDown</td>
<td class="org-left">label = J * Smith</td>
</tr>

<tr>
<td class="org-left">assertSelected</td>
<td class="org-left">document.forms[a].dropDown</td>
<td class="org-left">index = 0</td>
</tr>
</tbody>
</table>
<p>
assertSelectedOptions(selectLocator, optionLabelList)
</p>
<ul class="org-ul">
<li>检查下拉菜单中的选项的文本是否和 optionLabelList 相同</li>
<li>optionLabelList 是以逗号分割的一个字符串</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifySelectOption</td>
<td class="org-left">dropdown2</td>
<td class="org-left">John Smith,Dave Bird</td>
</tr>

<tr>
<td class="org-left">assertSelectedOptions</td>
<td class="org-left">dropdown2</td>
<td class="org-left">Smith, J, Bird, D</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc2088fd" class="outline-4">
<h4 id="orgc2088fd">assertText</h4>
<div class="outline-text-4" id="text-orgc2088fd">
<p>
assertText(elementLocator, textPattern)
</p>
<ul class="org-ul">
<li>检查指定元素的文本</li>
<li>只对有包含文本的元素生效</li>
<li>对于 Mozilla 类型的浏览器，用 textContent 取元素的文本，对于 IE 类型的浏览器，用 innerText 取元素文本</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyText</td>
<td class="org-left">statusMessage</td>
<td class="org-left">Successful</td>
</tr>

<tr>
<td class="org-left">assertText</td>
<td class="org-left">//div[@id='foo']//h1</td>
<td class="org-left">Successful</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org37ecd93" class="outline-4">
<h4 id="org37ecd93">assertTextPresent, assertAttribute</h4>
<div class="outline-text-4" id="text-org37ecd93">
<p>
assertTextPresent(text)
</p>
<ul class="org-ul">
<li>检查在当前给用户显示的页面上是否有出现指定的文本</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyTextPresent</td>
<td class="org-left">You are now logged in</td>
</tr>

<tr>
<td class="org-left">assertTextPresent</td>
<td class="org-left">You are now logged in</td>
</tr>
</tbody>
</table>
<p>
assertAttribute(.{} elementLocator@attributeName. {},ValuePattern)
</p>
<ul class="org-ul">
<li>检查当前指定元素的属性的值</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyAttribute</td>
<td class="org-left">txt1@class</td>
<td class="org-left">bigAndBlod</td>
</tr>

<tr>
<td class="org-left">assertAttribute</td>
<td class="org-left">document.images[a]@alt</td>
<td class="org-left">alt-text</td>
</tr>

<tr>
<td class="org-left">verifyAttribute</td>
<td class="org-left">//img[@id='foo']/alt</td>
<td class="org-left">alt-text</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org060a706" class="outline-4">
<h4 id="org060a706">assertTextPresent, etc.</h4>
<div class="outline-text-4" id="text-org060a706">
<p>
assertTextPresent(text)
assertTextPresent(text)
assertTextNotPresent(text)
assertElementPresent(elementLocator)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyElementPresent</td>
<td class="org-left">submitButton</td>
</tr>

<tr>
<td class="org-left">assertElementPresent</td>
<td class="org-left">//img[@alt='foo']</td>
</tr>

<tr>
<td class="org-left">assertElementPresent</td>
<td class="org-left">dropDown2</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1bc92df" class="outline-4">
<h4 id="org1bc92df">assertTable</h4>
<div class="outline-text-4" id="text-org1bc92df">
<p>
assertTable(cellAddress, valuePattern)
</p>
<ul class="org-ul">
<li>检查 table 里的某个 cell 中的值</li>
<li>cellAddress 的语法是 tableName.row.column,注意行列序号是从 0 开始的</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyTable</td>
<td class="org-left">myTbale.1.5</td>
<td class="org-right">Submitted</td>
</tr>

<tr>
<td class="org-left">assertTable</td>
<td class="org-left">results0.2</td>
<td class="org-right">13</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3370968" class="outline-4">
<h4 id="org3370968">assertVisible, assertNotVisible</h4>
<div class="outline-text-4" id="text-org3370968">
<p>
assertVisible(elementLocator)
</p>
<ul class="org-ul">
<li>检查指定的元素是否可视的</li>
<li>隐藏一个元素可以用设置 css 的 <code>visibility</code> 属性为 <code>hidden</code> ,也可以设置 <code>display</code> 属性为 <code>none</code></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyVisible</td>
<td class="org-left">postcode</td>
</tr>

<tr>
<td class="org-left">assertVisible</td>
<td class="org-left">postcode</td>
</tr>
</tbody>
</table>
<p>
assertNotVisible(elementLocator)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyNotVisible</td>
<td class="org-left">postcode</td>
</tr>

<tr>
<td class="org-left">assertNotVisible</td>
<td class="org-left">postcode</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org47dbd6d" class="outline-4">
<h4 id="org47dbd6d">Editable, non-editable</h4>
<div class="outline-text-4" id="text-org47dbd6d">
<p>
assertEditable(inputLocator)
</p>
<ul class="org-ul">
<li>检查指定的 input 是否可以编辑</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">verifyEditalbe</td>
<td class="org-left">shape</td>
</tr>

<tr>
<td class="org-left">assertEditable</td>
<td class="org-left">color</td>
</tr>
</tbody>
</table>
<p>
assertNotEditable(inputLocator)
</p>
<ul class="org-ul">
<li>检查指定的 input 是否不可以编辑</li>
</ul>
</div>
</div>
<div id="outline-container-org06db5a3" class="outline-4">
<h4 id="org06db5a3">assertAlert</h4>
<div class="outline-text-4" id="text-org06db5a3">
<p>
assertAlert(messagePattern)
</p>
<ul class="org-ul">
<li>检查 JavaScript 是否产生带指定 message 的 alert 对话框</li>
<li>alert 产生的顺序必须与检查的顺序一致</li>
<li>检查 alert 时会产生与手动点击 <code>OK</code> 按钮一样的效果。如果一个 alert 产生了，而你却没有去检查它。selenium 会在下个 action 中报错</li>
<li>注意：Selenium 不支持 JavaScript 在 onload() 事件时，调用 alert()，在这种情况下，Selenium 需要你手动来点击 <code>OK</code></li>
</ul>
</div>
</div>
<div id="outline-container-org7f1ee1c" class="outline-4">
<h4 id="org7f1ee1c">assertConfirmation</h4>
<div class="outline-text-4" id="text-org7f1ee1c">
<p>
assertConfirmation(messagePattern)
</p>
<ul class="org-ul">
<li>检查 JavaScript 是否有产生带指定 messages 的 confirmation 对话框和 alert 怦呈样，confirmation 也必须在它们产生的时候进行检查</li>
<li>默认情况下，Seleniu 会让 confirm() 返回 true，相当于手动点击 <code>OK</code> 按钮的效果。你能够通过 chooseCancelOnNextConfirmation 命令让 confirm() 返回 false。同样的，如果一个 confirmation 对话框出现了，但你却没有检查的话，Selenium 将会在下个 action 中报错</li>
<li>注意：在 Selenium 的环境下，confirmation 对话框将不会再出现弹出显式对话框</li>
<li>注意：Selenium 不支持在 onload() 事件时调用 confirmation 对话框，在这种情况下，会出现显示的 confirmation 的对话框，并需要你自己动手点击</li>
</ul>
</div>
</div>
<div id="outline-container-org9c6d3c7" class="outline-4">
<h4 id="org9c6d3c7">assertPrompt</h4>
<div class="outline-text-4" id="text-org9c6d3c7">
<p>
assertPrompt(messagePattern)
</p>
<ul class="org-ul">
<li>检查 JavaScript 是否有产生带指定 message 的 Prompt 对话框</li>
<li>检查的 prompt 的顺序与 Prompt 对话框的顺序必须相同</li>
<li>必须在 verifyPrompt 之前调用 answerOnNextPrompt 命令</li>
<li>如果 prompt 对话框出现了，但你却没有检查，则 Selenium 会在下个 action 中报错</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">answerOnNextPrompt</td>
<td class="org-left">Joe</td>
</tr>

<tr>
<td class="org-left">click</td>
<td class="org-left">id = delegate</td>
</tr>

<tr>
<td class="org-left">verifyPrompt</td>
<td class="org-left">Delegate to who?</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org983b980" class="outline-3">
<h3 id="org983b980">Parameters and Variables</h3>
<div class="outline-text-3" id="text-org983b980">
<p>
参数和变量的声明范围由简单的赋值到 JavaScript 表达式的赋值
Store, storeValue 和 storeText 为下次访问保存值
在 Selenium 内部是用一个叫 storeVars 的 map 来保存变量名
</p>
</div>
<div id="outline-container-orged0e48e" class="outline-4">
<h4 id="orged0e48e">Variable Substitution 变量替换</h4>
<div class="outline-text-4" id="text-orged0e48e">
<p>
提供了一个简单的方法去访问变量，语法 ${xxx}
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">store</td>
<td class="org-left">Mr</td>
<td class="org-left">title</td>
</tr>

<tr>
<td class="org-left">storeValue</td>
<td class="org-left">nameField</td>
<td class="org-left">suname</td>
</tr>

<tr>
<td class="org-left">store</td>
<td class="org-left">$.{title} $.{suname}</td>
<td class="org-left">fullname</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-left">textElement</td>
<td class="org-left">Full name is: $.{fullname}</td>
</tr>
</tbody>
</table>
</div>
</div>
